In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("C:\\Users\\Priyanshu\\Downloads\\employees.csv")
print(data)

      Name           Position  Department  Salary
0    Alice  Software Engineer          IT   90000
1      Bob       Data Analyst     Finance   70000
2  Charlie         HR Manager          HR   80000
3    Diana    Project Manager  Operations   95000

In [5]:
data.columns

Index(['Name', 'Position', 'Department', 'Salary'], dtype='object')

In [6]:
data.head(1)

    Name           Position Department  Salary
0  Alice  Software Engineer         IT   90000

In [7]:
data.tail(1)

    Name         Position  Department  Salary
3  Diana  Project Manager  Operations   95000

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        4 non-null      object
 1   Position    4 non-null      object
 2   Department  4 non-null      object
 3   Salary      4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes